{
  "books": [
    {
      "title": "Harry Potter and the philosopher's stone",
      "id": "p3QQjwEACAAJ",
      "author": "J. K. Rowling",
      "year": "2010",
      "description": "Ten-year-old Harry Potter is an orphan who lives in the fictional London suburb of Little Whinging, Surrey, with the Dursleys: his uncaring Aunt Petunia, loathsome Uncle Vernon, and spoiled cousin Dudley. The Dursleys barely tolerate Harry, and Dudley bullies him. One day Harry is astonished to receive a letter addressed to him in the cupboard under the stairs (where he sleeps). Before he can open the letter, however, Uncle Vernon takes it. Letters for Harry subsequently arrive each day, in increasing numbers, but Uncle Vernon tears them all up, and finally, in an attempt to escape the missives, the Dursleys go to a miserable shack on a small island. On Harry’s 11th birthday, a giant named Hagrid arrives and reveals that Harry is a wizard and that he has been accepted at the Hogwarts School of Witchcraft and Wizardry. He also sheds light on Harry’s past, informing the boy that his parents, a wizard and a witch, were killed by the evil wizard Voldemort and that Harry acquired the lightning-bolt scar on his forehead during the fatal confrontation.",
      "category": "Juvenile Fiction",
      "pageCount": 254,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282179033632798/unknown.png"
    },
    {
      "title": "The Wise Man's Fear (The Kingkiller Chronicle: Day 2)",
      "id": "2euKXB-3_aoC",
      "author": "Patrick Rothfuss",
      "year": "2011",
      "description": "«You may have heard of me.» So begins the tale of a hero told from his own point of view — a story unequaled in fantasy literature. Now in The Wise Man's Fear, an escalating rivalry with a powerful member of the nobility forces Kvothe to leave the University and seek his fortune abroad. Adrift, penniless, and alone, he travels to Vintas, where he quickly becomes entangled in the politics of courtly society. While attempting to curry favor with a powerful noble, Kvothe uncovers an assassination attempt, comes into conflict with a rival arcanist, and leads a group of mercenaries into the wild, in an attempt to solve the mystery of who (or what) is waylaying travelers on the King's Road.",
      "category": "Fiction",
      "pageCount": 1200,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282240136253440/unknown.png"
    },
    {
      "title": "A Game of Thrones",
      "id": "5NomkK4EV68C",
      "author": "George R. R. Martin",
      "year": "2003",
      "description": "Winter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert’s name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse—unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season. Yet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen’s brothers Jaime and Tyrion of the powerful and wealthy House Lannister—the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms. Meanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki—whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys.",
      "category": "Fiction",
      "pageCount": 835,
      "image": "http://books.google.com/books/content?id=5NomkK4EV68C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "Harry Potter and the Goblet of Fire",
      "id": "NvNcAAAACAAJ",
      "author": "J. K. Rowling",
      "year": "2011",
      "description": "It is the summer holidays and soon Harry Potter will be starting his fourth year at Hogwarts School of Witchcraft and Wizardry. Harry is counting the days: there are new spells to be learnt, more Quidditch to be played, and Hogwarts castle to continue exploring. But Harry needs to be careful - there are unexpected dangers lurking...",
      "category": "Juvenile Fiction",
      "pageCount": 635,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282351847342101/unknown.png"
    },
    {
      "title": "Harry Potter and the Chamber of Secrets",
      "id": "zl13g5uRM4EC",
      "author": "J. K. Rowling",
      "year": "2015",
      "description": "Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he’s packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike. And strike it does. For in Harry’s second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girls’ bathroom. But then the real trouble begins – someone is turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects… Harry Potter himself!",
      "category": "Juvenile Fiction",
      "pageCount": 365,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282398823546921/unknown.png"
    },
    {
      "title": "Harry Potter and the Half-Blood Prince",
      "id": "z2hczgEACAAJ",
      "author": "J. K. Rowling",
      "year": "2021",
      "description": "At age sixteen, in the midst of serious events plaguing England, Harry begins his sixth year at Hogwarts. Having been chosen captain of the Quidditch team, practices, tests, and girls are keeping him busy, but that peace and tranquility is short-lived. Despite tight security measures that protect the school, two students are brutally attacked. Dumbledore knows that, as proclaimed in the Prophecy, the time is approaching when Harry and Voldemort must face each other in a deadly match: «The only one with strong enough powers to defeat the Dark Lord is approaching... One of the two must die at the hands of the other, because neither can live as long as the other is still alive.» The old Headmaster will enlist Harry's help, and together they will undertake dangerous trips in order to try to weaken the enemy, for this the young wizard will have the help of an old potion book that belonged to a mysterious person, someone who calls himself the Half-Blood Prince.",
      "category": "Juvenile Fiction",
      "pageCount": 608,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282439692857364/unknown.png"
    },
    {
      "title": "The Name of the Wind (The Kingkiller Chronicle: Day 1",
      "id": "QeYF9kTMypgC",
      "author": "Patrick Rothfuss",
      "year": "2011",
      "description": "Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen. The intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as a fugitive after the murder of a king form a gripping coming-of-age story unrivaled in recent literature. A high-action story written with a poet's hand, The Name of the Wind is a masterpiece that will transport readers into the body and mind of a wizard.",
      "category": "Fiction",
      "pageCount": 880,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282482197930095/unknown.png"
    },
    {
      "title": "The Hunger Games",
      "id": "_zSzAwAAQBAJ",
      "author": "Suzanne Collins",
      "year": "2012",
      "description": "First in the ground-breaking HUNGER GAMES trilogy, this new foiled edition of THE HUNGER GAMES is available for a limited period of time. Set in a dark vision of the near future, a terrifying reality TV show is taking place. Twelve boys and twelve girls are forced to appear in a live event called The Hunger Games. There is only one rule: kill or be killed. When sixteen-year-old Katniss Everdeen steps forward to take her younger sister's place in the games, she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature.",
      "pageCount": 464,
      "category": "Juvenile Fiction",

      "image": "http://books.google.com/books/content?id=_zSzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "The Slow Regard of Silent Things",
      "id": "qQkFogEACAAJ",
      "author": "Patrick Rothfuss",
      "year": "2014",
      "description": "The Slow Regard of Silent Things is a brief, bittersweet glimpse of Auri’s life, a small adventure all her own. At once joyous and haunting, this story offers a chance to see the world through Aurir’s eyes. And it gives the reader a chance to learn things that only Auri knows.... In this book, Patrick Rothfuss brings us into the world of one of The Kingkiller Chronicle’s most enigmatic characters. Full of secrets and mysteries, The Slow Regard of Silent Things is the story of a broken girl trying to live in a broken world.",
      "category": "Juvenile Nonfiction",
      "pageCount": 128,
      "image": "https://cdn.discordapp.com/attachments/854123718753779762/1032282573969297479/unknown.png"
    },
    {
      "title": "Sherlock Holmes: The Complete Novels and Stories, Volume I",
      "id": "7ObWDwAAQBAJ",
      "author": "Arthur Conan Doyle",
      "year": "2020",
      "description": "Sherlock Holmes: The Complete Novels and Stories contains, in two volumes, all fifty-six short stories and four novels featuring Sir Arthur Conan Doyle’s world-famous detective. Volume I includes the novels and stories that introduced the brilliant and unflappable Sherlock Holmes and his partner, Dr. Watson, to the world. A Study in Scarlet is a drama of long-simmering revenge that ranges from the fog-bound streets of London to the pioneer settlements of Utah. The Sign of Four weaves together a stolen treasure from India, poison darts, and double-crossing thieves, while The Hound of the Baskervilles sets the legend of a diabolical hellhound and an old family curse against the backdrop of a moonlit moor. The short stories in this volume include such favorites as “A Scandal in Bohemia,” “The Red-Headed League,” “The Adventure of the Speckled Band,” and “The Final Problem,” tales that have thrilled generations of readers with Holmes’s astounding powers of deduction.",
      "category": "Fiction",
      "pageCount": 800,
      "image": "http://books.google.com/books/content?id=7ObWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "Les Miserables",
      "id": "3AuREAAAQBAJ",
      "author": "Victor Hugo",
      "year": "2012",
      "description": "Now a major musical film from Oscar-winning director Tom Hooper (The King's Speech), starring Hugh Jackman, Russell Crowe and Anne Hathaway, and also featuring Amanda Seyfreid, Helena Bonham-Carter and Sacha Baron-Cohen, Victor Hugo's Les Misérables is one of the great works of western literature. Victor Hugo's tale of injustice, heroism and love follows the fortunes of Jean Valjean (Hugh Jackman), an escaped convict determined to put his criminal past behind him. But his attempts to become a respected member of the community are constantly put under threat: by his own conscience, when, owing to a case of mistaken identity, another man is arrested in his place; and by the relentless investigations of the dogged Inspector Javert (Russell Crowe). It is not simply for himself that Valjean must stay free, however, for he has sworn to protect the baby daughter of Fantine (Anne Hathaway), driven to prostitution by poverty. Victor Hugo (1802-85) wrote volumes of criticism, Romantic costume dramas, satirical verse and political journalism but is best remembered for his novels, especially Notre-Dame de Paris (1831), also known as The Hunchback of Notre-Dame and Les Misérables (1862) which was adapted into one of the most successful musicals of all time. 'All human life is here' Cameron Mackintosh, producer of the musical Les Misérables 'One of the half-dozen greatest novels of the world' Upton Sinclair 'A great writer - inventive, witty, sly, innovatory' A. S. Byatt, author of Possession",
      "category": "Fiction",
      "pageCount": 1462,
      "image": "http://books.google.com/books/content?id=3AuREAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
      "title": "Gardens of the Moon",
      "id": "Jgth_BYe7V8C",
      "author": "Steven Erikson",
      "year": "2004",
      "description": "Vast legions of gods, mages, humans, dragons and all manner of creatures play out the fate of the Malazan Empire in this first book in a major epic fantasy series The Malazan Empire simmers with discontent, bled dry by interminable warfare, bitter infighting and bloody confrontations with the formidable Anomander Rake and his Tiste Andii, ancient and implacable sorcerers. Even the imperial legions, long inured to the bloodshed, yearn for some respite. Yet Empress Laseen's rule remains absolute, enforced by her dread Claw assassins. For Sergeant Whiskeyjack and his squad of Bridgeburners, and for Tattersail, surviving cadre mage of the Second Legion, the aftermath of the siege of Pale should have been a time to mourn the many dead. But Darujhistan, last of the Free Cities of Genabackis, yet holds out. It is to this ancient citadel that Laseen turns her predatory gaze. However, it would appear that the Empire is not alone in this great game. Sinister, shadowbound forces are gathering as the gods themselves prepare to play their hand... Conceived and written on a panoramic scale, Gardens of the Moon is epic fantasy of the highest order--an enthralling adventure by an outstanding new voice. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "pageCount": 496,
      "category": "Fiction",
      "image": "https://github.com/avilalte/skillfactory-third-project/blob/master/src/assets/images/Me.jpg?raw=true"
    },
    {
      "title": "Sherlock Holmes: The Complete Novels and Stories, Volume II",
      "id": "7ubWDwAAQBAJ",
      "author": "Arthur Conan Doyle",
      "year": "2020",
      "description": "Sherlock Holmes: The Complete Novels and Stories contains, in two volumes, all fifty-six short stories and four novels featuring Sir Arthur Conan Doyle’s world-famous detective. Volume II contains the fourth of the Sherlock Holmes novels, The Valley of Fear, in which Holmes memorably faces his malignant archenemy, Professor Moriarty. The short stories collected here include such celebrated gems as \"The Adventure of Wisteria Lodge,\" \"The Adventure of the Red Circle,\" \"The Adventure of the Devil's Foot,\" \"The Adventure of the Sussex Vampire,\" and \"His Last Bow: The War Service of Sherlock Holmes.\" With the stories from the final collection, The Case-Book of Sherlock Holmes, published in 1927, this volume carries the venerable detective through to the very end of his enthralling four-decade career as one of the most beloved characters in literature.",
      "category": "Fiction",
      "pageCount": 800,
      "image": "http://books.google.com/books/content?id=7ubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "White Fang",
      "id": "zrf2vQAACAAJ",
      "author": "Jack London",
      "year": "2016",
      "description": "White Fang is a novel by American author Jack London (1876-1916) - and the name of the book's eponymous character, a wild wolfdog. First serialized in Outing magazine, it was published in 1906. The story takes place in Yukon Territory and the Northwest Territories, Canada, during the 1890s Klondike Gold Rush and details White Fang's journey to domestication. It is a companion novel (and a thematic mirror) to London's best-known work, The Call of the Wild, which is about a kidnapped, domesticated dog embracing his wild ancestry to survive and thrive in the wild. Much of White Fang is written from the viewpoint of the titular canine character, enabling London to explore how animals view their world and how they view humans.",
      "category": "Adventure",
      "pageCount": 288,
      "image": "https://github.com/avilalte/skillfactory-third-project/blob/master/src/assets/images/fr.jpg?raw=true"
    },
    {
      "title": "Sherlock Holmes",
      "id": "UVMGAQAAIAAJ",
      "author": "Arthur Conan Doyle",
      "year": "1957",
      "category": "Detective stories",
      "pageCount": 1777,
      "image": "https://i.pinimg.com/474x/88/ce/0d/88ce0df399383381067d6716d52fd8bf--sherlock-holmes.jpg"
    },
    {
      "title": "A Clash of Kings",
      "id": "ZfiREZrremoC",
      "author": "George R. R. Martin",
      "year": "2003",
      "description": "THE BOOK BEHIND THE SECOND SEASON OF GAME OF THRONES, AN ORIGINAL SERIES NOW ON HBO. A SONG OF ICE AND FIRE: BOOK TWO In this thrilling sequel to A Game of Thrones, George R. R. Martin has created a work of unsurpassed vision, power, and imagination. A Clash of Kings transports us to a world of revelry and revenge, wizardry and warfare unlike any we have ever experienced. A comet the color of blood and flame cuts across the sky. And from the ancient citadel of Dragonstone to the forbidding shores of Winterfell, chaos reigns. Six factions struggle for control of a divided land and the Iron Throne of the Seven Kingdoms, preparing to stake their claims through tempest, turmoil, and war. It is a tale in which brother plots against brother and the dead rise to walk in the night. Here a princess masquerades as an orphan boy; a knight of the mind prepares a poison for a treacherous sorceress; and wild men descend from the Mountains of the Moon to ravage the countryside. Against a backdrop of incest and fratricide, alchemy and murder, victory may go to the men and women possessed of the coldest steel . . . and the coldest hearts. For when kings clash, the whole land trembles.",
      "category": "Fiction",
      "pageCount": 784,
      "image": "http://books.google.com/books/content?id=ZfiREZrremoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "The Shining",
      "id": "8VnJLu3AvvQC",
      "author": "Stephen King",
      "year": "2008",
      "description": "#1 NEW YORK TIMES BESTSELLER • Before Doctor Sleep, there was The Shining, a classic of modern American horror from the undisputed master, Stephen King. Jack Torrance’s new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he’ll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote . . . and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.",
      "category": "Fiction",
      "pageCount": 464,
      "image": "http://books.google.com/books/content?id=8VnJLu3AvvQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "Star Wars: Bloodline",
      "id": "nte-CwAAQBAJ",
      "author": "Claudia Gray",
      "year": "2016",
      "description": "The Sunday Times Bestseller WITNESS THE BIRTH OF THE RESISTANCE When the Rebellion defeated the Empire in the skies above Endor, Leia Organa believed it was the beginning to a lasting peace. But after decades of vicious infighting and partisan gridlock in the New Republic Senate, that hope seems like a distant memory. Now a respected senator, Leia must grapple with the dangers that threaten to cripple the fledgling democracy—from both within and without. Underworld kingpins, treacherous politicians, and Imperial loyalists are sowing chaos in the galaxy. Desperate to take action, senators are calling for the election of a First Senator. It is their hope that this influential post will bring strong leadership to a divided galaxy. As the daughter of Darth Vader, Leia faces with distrust the prospect of any one person holding such a powerful position—even when supporters suggest Leia herself for the job. But a new enemy may make this path Leia’s only option. For at the edges of the galaxy, a mysterious threat is growing...",
      "category": "Fiction",
      "pageCount": 432,
      "image": "http://books.google.com/books/content?id=nte-CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "Dark Tower",
      "id": "6ErsngEACAAJ",
      "author": "Stephen King",
      "year": "2008",
      "description": "After seeing the death of his lover Susan Delgado, Gunslinger Roland Deschain and his ka-tet Cuthbert and Alain are forced to flee into the desert with a deadly posse--the Big Coffin Hunters--in hot pursuit. Original.",
      "category": "Comics & Graphic Novels",
      "pageCount": 160,
      "image": "http://books.google.com/books/content?id=6ErsngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
      "title": "The Fellowship of the Ring (The Lord of the Rings, Book 1)",
      "id": "xFr92V2k3PIC",
      "author": "J. R. R. Tolkien",
      "year": "2009",
      "description": "The first part of J. R. R. Tolkien’s epic adventure THE LORD OF THE RINGS ‘A most remarkable feat’ Guardian",
      "category": "Fiction",
      "pageCount": 448,
      "image": "http://books.google.com/books/content?id=xFr92V2k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  ]
}
